Repository: Taichone/iOS-training-Taichone
Catalog: iOS-training-Taichone/Localizable.xcstrings
Source language: en
Languages: ja

source: By Area
ja: エリア別

source: Cancel
ja: キャンセル

# error-message-request
source: There was an error with the request, and the weather forecast could not be retrieved.
ja: 要求にエラーが発生し、天気予報を取得できませんでした。

# error-message-response
source: There was an error with the response, and the weather forecast could not be retrieved.
ja: 応答にエラーが発生し、天気予報を取得できませんでした。

# error-message-unknown
source: An unknown error occurred, and the weather forecast could not be retrieved.
ja: 不明なエラーが発生し、天気予報を取得できませんでした。

source: Failed to retrieve weather
ja: 天気の取得に失敗

source: Fukuoka
ja: 福岡

source: Hiroshima
ja: 広島

source: Kagoshima
ja: 鹿児島

source: Kanazawa
ja: 金沢

source: Kochi
ja: 高知

source: Nagoya
ja: 名古屋

source: Naha
ja: 那覇

source: Niigata
ja: 新潟

source: Osaka
ja: 大阪

source: Retry
ja: リトライ

source: Sapporo
ja: 札幌

source: Sendai
ja: 仙台

source: Tokyo
ja: 東京
